package main

import "fmt"

func main() {
	// 重点讲解 /、%
	// 说明，如果运算的数都是整数，那么除后，去掉小数点部分，保留整数部分
	fmt.Println(" 10/4 = ", 10/4) //

	var f1 float32 = 10 / 4 // 依然只保留整数部分。
	fmt.Println("f1 = ", f1)
	// 如果一定要 小数，则需要有浮点数参与运算
	var f2 float32 = 10.0 / 4
	fmt.Println("f2 = ", f2)

	// ---------------------------------------------------------------

	// 演示取模的用法 %  （取余）
	// 看一个公式  a%b = a - a/b *b
	fmt.Println("10 % 3:", 10%3)     // =1 10 - 10/3*3 = 1
	fmt.Println("10 % -3:", 10%-3)   // =1   10 - 10/(-3)*3 = 1
	fmt.Println("-10 % 3:", -10%3)   // =1  -10 - (-10)/3*3 = -1
	fmt.Println("-10 % -3:", -10%-3) // =1  -10 - (-10)/(-3)*(-3) = -1

	// ------------------------------------------------------

	// ++ 和 -- 的使用
	var i int = 10
	i++ // 等价于 i = i + 1
	fmt.Println(" i ++ = ", i)
	i-- // 等价于i = i - 1
	fmt.Println(" i -- = ", i)
}
